'use strict';

const mockCategories = [
  `Деревья`,
  `Разное`,
  `Программирование`,
  `За жизнь`,
  `Велоспорт`,
  `Железо`,
  `Путешествия`,
  `Музыка`
];

const mockArticles = [
  {
    title: `Борьба с прокрастинацией`,
    date: `2021-04-01T17:04:50.012Z`,
    announce: `Простые ежедневные упражнения помогут достичь успеха. Золотое сечение — соотношение двух величин, гармоническая пропорция. Первая большая ёлка была установлена только в 1938 году. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.`,
    fullText: `Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.`,
    categories: [
      `Деревья`,
      `Разное`,
      `Программирование`,
      `За жизнь`,
      `Велоспорт`,
      `Железо`
    ],
    image: `skyscraper@1x.jpg`,
  },
  {
    title: `Учим HTML и CSS`,
    date: `2021-03-02T07:42:32.487Z`,
    announce: `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Простые ежедневные упражнения помогут достичь успеха. Это один из лучших рок-музыкантов.`,
    fullText: `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Первая большая ёлка была установлена только в 1938 году. Достичь успеха помогут ежедневные повторения. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Из под его пера вышло 8 платиновых альбомов. Программировать не настолько сложно, как об этом говорят. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Простые ежедневные упражнения помогут достичь успеха. Ёлки — это не просто красивое дерево. Это прочная древесина. Он написал больше 30 хитов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Это один из лучших рок-музыкантов. Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    categories: [
      `Путешествия`,
      `Велоспорт`,
      `Разное`,
      `Железо`
    ],
    image: `skyscraper@1x.jpg`,
  },
  {
    title: `Как собрать камни бесконечности`,
    date: `2021-02-11T11:31:37.094Z`,
    announce: `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    fullText: `Золотое сечение — соотношение двух величин, гармоническая пропорция. Собрать камни бесконечности легко, если вы прирожденный герой. Как начать действовать? Для начала просто соберитесь. Ёлки — это не просто красивое дерево. Это прочная древесина. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Он написал больше 30 хитов. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Это один из лучших рок-музыкантов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Программировать не настолько сложно, как об этом говорят.`,
    categories: [
      `Деревья`,
      `Разное`,
      `Музыка`,
      `Программирование`
    ],
    image: `skyscraper@1x.jpg`,
  }
];

const mockUsers = [
  {
    firstname: `Иван`,
    lastname: `Иванов`,
    email: `ivan@ya.ru`,
    password: `0403942d9d1bd8c2f93ea2f08abd7ba7`,
    avatar: `avatar.jpg`,
    admin: true
  },
  {
    firstname: `Петр`,
    lastname: `Петров`,
    email: `petr@ya.ru`,
    password: `0403942d9d1bd8c2f93ea2f08abd7ba7`,
    avatar: `avatar.jpg`,
    admin: false
  },
];

const mockComments = [
  {
    text: `Мне кажется или я уже читал это где-то? Планируете записать видосик на эту тему? Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`,
    articleId: 1,
    userId: 2,
  },
  {
    text: `Хочу такую же футболку :-)`,
    articleId: 1,
    userId: 1,
  },
  {
    text: `Планируете записать видосик на эту тему? Мне кажется или я уже читал это где-то?`,
    articleId: 2,
    userId: 2,
  },
  {
    text: `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`,
    articleId: 2,
    userId: 1,
  },
  {
    text: `Хочу такую же футболку :-) Планируете записать видосик на эту тему? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`,
    articleId: 2,
    userId: 2,
  },
  {
    text: `Плюсую, но слишком много буквы!`,
    articleId: 2,
    userId: 1,
  },
  {
    text: `Совсем немного... Мне кажется или я уже читал это где-то? Это где ж такие красоты?`,
    articleId: 3,
    userId: 2,
  }
];

module.exports = {mockCategories, mockArticles, mockUsers, mockComments};
